tests/src/serviceTest/resources/request/consultationDroits/v3/19_cumul_request3.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://ws.cegedimassurance.com/basededroit/wsdl" xmlns:base="http://norme.cegedimassurances.com/base_de_droit" xmlns:com="http://norme.cegedimassurances.com/commun" xmlns:ben="http://norme.cegedimassurances.com/beneficiaire" xmlns:amc="http://norme.cegedimassurances.com/amc">
    <soap:Header/>
    <soap:Body>
        <wsdl:getInfoBddRequest>
            <base:header_in>
                <com:headerTech>
                    <com:id_logiciel_client>LGPLBZ000280</com:id_logiciel_client>
                    <com:version_logiciel_client>1</com:version_logiciel_client>
                    <com:id_session_client>2019040409503208792</com:id_session_client>
                </com:headerTech>
                <com:headerFonc>
                    <com:code_contexte>CD-01</com:code_contexte>
                    <com:code_proprietaire>0000452433</com:code_proprietaire>
                    <com:code_gestionnaire>38125032300015</com:code_gestionnaire>
                </com:headerFonc>
            </base:header_in>
            <base:beneficiaire>
                <ben:NIR_certifie>2881199350342</ben:NIR_certifie>
                <ben:cle_NIR>97</ben:cle_NIR>
                <ben:date_naissance>19881122</ben:date_naissance>
                <ben:rang_gemellaire>1</ben:rang_gemellaire>
            </base:beneficiaire>
            <base:amc>
                <amc:numero_AMC_prefectoral>0000452433</amc:numero_AMC_prefectoral>
            </base:amc>
            <base:info_bdd>
                <base:type_recherche_benef>0</base:type_recherche_benef>
                <base:type_recherche_segment>1</base:type_recherche_segment>
                <base:type_segment_recherche>PHOR</base:type_segment_recherche>
                <base:type_profondeur_recherche>0</base:type_profondeur_recherche>
            </base:info_bdd>
            <base:dates>
                <com:date_reference>2021-03-31</com:date_reference>
                <com:type_date_reference>3</com:type_date_reference>
            </base:dates>
        </wsdl:getInfoBddRequest>
    </soap:Body>
</soap:Envelope>
